openclaw/esp-openclaw-node/examples/waveshare-esp32-s3-touch-amoled-2.06-room-node/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_ESP_OPENCLAW_NODE_TASK_STACK_SIZE=12288
CONFIG_ESP_OPENCLAW_NODE_TRANSPORT_TASK_STACK_SIZE=12288
